Autodesk.Revit.Utility.AssetPropertyDoubleMatrix44.Value
Get the value of the property

Autodesk.Revit.Utility.AssetPropertyDoubleMatrix44
Represents a property consisting of an array of double values.
Remarks:
In virtually all cases, the array will contain exactly 16 values.
It represents a 4x4 matrix.